# Cookbook
This is a repository for short and sweet examples and links for useful pandas recipes. We encourage users to add to this documentation.

Adding interesting links and/or inline examples to this section is a great First Pull Request.

Simplified, condensed, new-user friendly, in-line examples have been inserted where possible to augment the Stack-Overflow and GitHub links. Many of the links contain expanded information, above what the in-line examples offer.

pandas (pd) and NumPy (np) are the only two abbreviated imported modules. The rest are kept explicitly imported for newer users.

[link] https://pandas.pydata.org/pandas-docs/stable/user_guide/cookbook.html

## idioms
These are some neat pandas idioms
if-then/if-then-else on one column, and assignment to another one or more columns:

In [37]:
import pandas as pd
import numpy as np

## df - if-then
+ df.loc[df.AAA >= 5, "BBB"] 
+ df.loc[df.AAA < 5, ["BBB", "CCC"]]

In [28]:
df = pd.DataFrame(
    {
    "AAA": [4, 5, 6, 7], 
    "BBB": [10, 20, 30, 40], 
    "CCC": [100, 50, -30, -50]
    }
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

### if-then…
An if-then on one column

In [40]:
df.loc[df.AAA >= 5, "BBB"] = -1
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

### else
+ An if-then with assignment to 2 columns: 
+ Add another line with different logic, to do the -else

In [15]:
df.loc[df.AAA >= 5, ["BBB", "CCC"]] = 555 # df.loc[df.AAA < 5, ["BBB", "CCC"]] = 2000

In [16]:
df

   AAA   BBB   CCC
0    4  2000  2000
1    5   555   555
2    6   555   555
3    7   555   555

### mask
Or use pandas where after you’ve set up a mask

In [21]:
df_mask = pd.DataFrame(
    {"AAA": [True] * 4, "BBB": [False] * 4, "CCC": [True, False] * 2}
)

In [22]:
df.where(df_mask, -1000)

   AAA   BBB   CCC
0    4 -1000   100
1    5 -1000 -1000
2    6 -1000   -30
3    7 -1000 -1000

### if-then-else using NumPy’s where()
np.where(df["AAA"] > 5, "high", "low")

In [35]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [38]:
df["logic"] = np.where(df["AAA"] > 5, "high", "low")

## df - Splitting
Split a frame with a boolean criterion
+ df[df.AAA <= 5]
+ df[df.AAA > 5]

In [39]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [27]:
df[df.AAA <= 5]

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

## df - Building criteria
Select with multi-column criteria
+ df.loc[(df["BBB"] < 25) & (df["CCC"] >= -40), "AAA"]
+ df.loc[(df.CCC - aValue).abs().argsort()]

In [25]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [41]:
df.loc[(df["BBB"] < 25) & (df["CCC"] >= -40), "AAA"]

0    4
1    5
2    6
Name: AAA, dtype: int64

In [48]:
df.loc[(df["BBB"] > 25) | (df["CCC"] >= -40), "AAA"]

0    0.1
1    5.0
2    6.0
Name: AAA, dtype: float64

In [46]:
df.loc[(df["BBB"] > 25) | (df["CCC"] >= 75), "AAA"] = 0.1
df

   AAA  BBB  CCC
0  0.1   10  100
1  5.0   -1   50
2  6.0   -1  -30
3  7.0   -1  -50

### Select rows with data closest to certain value using argsort
df.loc[(df.CCC - aValue).abs().argsort()]

In [55]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [56]:
aValue = 43.0
df.loc[(df.CCC - aValue).abs().argsort()]

   AAA  BBB  CCC
1    5   20   50
0    4   10  100
2    6   30  -30
3    7   40  -50

### Dynamically reduce a list of criteria using a binary operators
import functools
+ Crit1 = df.AAA <= 5.5
+ Crit2 = df.BBB == 10.0
+ Crit3 = df.CCC > -40.0
+ AllCrit = Crit1 & Crit2 & Crit3
+ CritList = [Crit1, Crit2, Crit3]
+ AllCrit = functools.reduce(lambda x, y: x & y, CritList)

In [58]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [59]:
Crit1 = df.AAA <= 5.5
Crit2 = df.BBB == 10.0
Crit3 = df.CCC > -40.0
AllCrit = Crit1 & Crit2 & Crit3

In [60]:
import functools
CritList = [Crit1, Crit2, Crit3]
AllCrit = functools.reduce(lambda x, y: x & y, CritList)

In [61]:
df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

## df - Selection
+ df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))]

### df - Dataframes

### Using both row labels and value conditionals
+ df.loc["bar":"kar"]  # Label
+ df[0:3]
+ df["bar":"kar"]
+ Using inverse operator (~) to take the complement of a mask
  - df[~((df.AAA <= 6) & (df.index.isin([0, 2, 4])))]

In [64]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [65]:
df[(df.AAA <= 6) & (df.index.isin([0, 2, 4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [68]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]},
    index=["foo", "bar", "boo", "kar"],
)
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [69]:
df.loc["bar":"kar"]  # Label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

### New columns
Efficiently and dynamically creating new columns using applymap
+ df[new_cols] = df[source_cols].applymap(categories.get)

### Efficiently and dynamically creating new columns using applymap

In [ ]:
df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [77]:
source_cols = df.columns  # Or some subset would work too
new_cols = [str(x) + "_cat" for x in source_cols]
categories = {1: "Alpha", 2: "Beta", 3: "Charlie"}
df[new_cols] = df[source_cols].applymap(categories.get)
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat AAA_cat_cat BBB_cat_cat CCC_cat_cat
0    1    1    2    Alpha   Alpha     Beta        None        None        None
1    2    1    1     Beta   Alpha    Alpha        None        None        None
2    1    2    3    Alpha    Beta  Charlie        None        None        None
3    3    2    1  Charlie    Beta    Alpha        None        None        None

### Keep other columns when using min() with groupby

In [80]:
df = pd.DataFrame(
    {"AAA": [1, 1, 1, 2, 2, 2, 3, 3], "BBB": [2, 1, 3, 4, 5, 1, 2, 3]}
)
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [90]:
df.groupby("AAA")["BBB"].value_counts()

AAA  BBB
1    1      1
     2      1
     3      1
2    1      1
     4      1
     5      1
3    2      1
     3      1
Name: BBB, dtype: int64

In [88]:
df.groupby("AAA")["BBB"].idxmin()

AAA
1    1
2    5
3    6
Name: BBB, dtype: int64

## df - Multiindexing

+ df = df.set_index("colume name")
+ df = df.set_index("row")
+ df.columns = pd.MultiIndex.from_tuples(
        (
        ("one", "X"),("one", "Y"),
        ("two", "X"),("two", "Y") 
        )
)


Creating a MultiIndex from a labeled frame

In [135]:
df = pd.DataFrame(
    {
        "row": [0, 1, 2],
        "One_X": [1.1, 1.1, 1.1],
        "One_Y": [1.2, 1.2, 1.2],
        "Two_X": [1.11, 1.11, 1.11],
        "Two_Y": [1.22, 1.22, 1.22],
    }
)
print(df)

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [136]:
# As Labelled Index
df = pd.DataFrame(
    {
        "row": [0, 1, 2],
        "One_X": [1.1, 1.1, 1.1],
        "One_Y": [1.2, 1.2, 1.2],
        "Two_X": [1.11, 1.11, 1.11],
        "Two_Y": [1.22, 1.22, 1.22],
    }
)
print(df.index)
print(df.columns)
df = df.set_index("row")
df

RangeIndex(start=0, stop=3, step=1)
Index(['row', 'One_X', 'One_Y', 'Two_X', 'Two_Y'], dtype='object')

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22

In [137]:
# With Hierarchical Columns
# c= df.columns
tuple1 = (("one", "X"),("one", "Y"),("two", "X"),("two", "Y") )
tuple1 = (["one", "X"],["one", "Y"],["two", "X"],["two", "Y"] )
# df.columns = pd.MultiIndex.from_tuples(tuple(c.split("_")))
df.columns = pd.MultiIndex.from_tuples(tuple1)
df

     one        two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

In [133]:
# Now stack & Reset
df_s = df.stack(0).reset_index(1)
df

    level_1     X     Y
row
0       one  1.10  1.20
0       two  1.11  1.22
1       one  1.10  1.20
1       two  1.11  1.22
2       one  1.10  1.20
2       two  1.11  1.22

## Arithmetic
Performing arithmetic with a MultiIndex that needs broadcasting

In [154]:
df = pd.DataFrame(
    {
        "row": [0, 1, 2],
        "One_X": [1.1, 1.1, 1.1],
        "One_Y": [1.2, 1.2, 1.2],
        "Two_X": [1.11, 1.11, 1.11],
        "Two_Y": [1.22, 1.22, 1.22],
    }
)
df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [168]:
# df.columns
# [(x, y) for x in df.columns for y in ["one", "two"]]
l1 = [(x, y) for x in ["A","B","C"] for y in ["O", "I"]]
# print(l1)
cols = pd.MultiIndex.from_tuples( l1 )
print(cols)
df = pd.DataFrame(np.random.randn(2, 6), index=["n", "m"], columns=cols)
df
# print(cols)

MultiIndex([('A', 'O'),
            ('A', 'I'),
            ('B', 'O'),
            ('B', 'I'),
            ('C', 'O'),
            ('C', 'I')],
           )

          A                   B                   C
          O         I         O         I         O         I
n -0.686561 -1.163115 -1.242373  0.861113 -2.190508 -0.862336
m -0.375438  0.168560  2.393970  0.822652 -0.045635 -0.993985

In [170]:
df = df.div(df["C"], level=1)
df

          A                    B              C
          O         I          O         I    O    I
n  0.313425  1.348795   0.567162 -0.998581  1.0  1.0
m  8.227007 -0.169580 -52.459277 -0.827630  1.0  1.0

## Slicing (under contruction)
+ Slicing a MultiIndex with xs
+ Slicing a MultiIndex with xs, method #2

In [171]:
import itertools

index = list(itertools.product(["Ada", "Quinn", "Violet"], ["Comp", "Math", "Sci"]))

headr = list(itertools.product(["Exams", "Labs"], ["I", "II"]))

indx = pd.MultiIndex.from_tuples(index, names=["Student", "Course"])

cols = pd.MultiIndex.from_tuples(headr)  # Notice these are un-named

data = [[70 + x + y + (x * y) % 3 for x in range(4)] for y in range(9)]

df = pd.DataFrame(data, indx, cols)

df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [174]:
All = slice(None)

In [175]:
df.loc["Violet"]

       Exams     Labs
           I  II    I  II
Course
Comp      76  77   78  79
Math      77  79   81  80
Sci       78  81   81  81

In [176]:
df.loc[(All, "Math"), All]

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Math      71  73   75  74
Quinn   Math      74  76   78  77
Violet  Math      77  79   81  80

In [179]:
slice("Ada", "Quinn")
slice(None)
print(All)

slice(None, None, None)

In [180]:
df.loc[(All, "Math"), (All, "II")]

               Exams Labs
                  II   II
Student Course
Ada     Math      73   74
Quinn   Math      76   77
Violet  Math      79   80

## Sorting
+ Sort by specific column or an ordered list of columns, with a MultiIndex

In [181]:
import itertools

index = list(itertools.product(["Ada", "Quinn", "Violet"], ["Comp", "Math", "Sci"]))

headr = list(itertools.product(["Exams", "Labs"], ["I", "II"]))

indx = pd.MultiIndex.from_tuples(index, names=["Student", "Course"])

cols = pd.MultiIndex.from_tuples(headr)  # Notice these are un-named

data = [[70 + x + y + (x * y) % 3 for x in range(4)] for y in range(9)]

df = pd.DataFrame(data, indx, cols)

df

               Exams     Labs
                   I  II    I  II
Student Course
Ada     Comp      70  71   72  73
        Math      71  73   75  74
        Sci       72  75   75  75
Quinn   Comp      73  74   75  76
        Math      74  76   78  77
        Sci       75  78   78  78
Violet  Comp      76  77   78  79
        Math      77  79   81  80
        Sci       78  81   81  81

In [182]:
df.sort_values(by=("Labs", "II"), ascending=False)

               Exams     Labs
                   I  II    I  II
Student Course
Violet  Sci       78  81   81  81
        Math      77  79   81  80
        Comp      76  77   78  79
Quinn   Sci       75  78   78  78
        Math      74  76   78  77
        Comp      73  74   75  76
Ada     Sci       72  75   75  75
        Math      71  73   75  74
        Comp      70  71   72  73

## Levels

## Missing data

## Replace

## Grouping (gb)
+ The grouping docs.
+ Basic grouping with apply
+ Unlike agg, apply’s callable is passed a sub-DataFrame which gives you access to all the columns


+ gb.sum()
+ gb.get_group("col")
+ gb.apply(fun)
+ gb.transform

In [184]:
df = pd.DataFrame(
    {
        "animal": "cat dog cat fish dog cat cat".split(),
        "size": list("SSMMMLL"),
        "weight": [8, 10, 11, 1, 20, 12, 12],
        "adult": [False] * 5 + [True] * 2,
    }
)
df

  animal size  weight  adult
0    cat    S       8  False
1    dog    S      10  False
2    cat    M      11  False
3   fish    M       1  False
4    dog    M      20  False
5    cat    L      12   True
6    cat    L      12   True

In [192]:
gb =df.groupby(["animal"])
gb.get_group("cat")
df.groupby(["animal", "size"]).sum()

             weight  adult
animal size
cat    L         24      2
       M         11      0
       S          8      0
dog    M         20      0
       S         10      0
fish   M          1      0

In [185]:
df.groupby("animal").apply(lambda subf: subf["size"][subf["weight"].idxmax()])

animal
cat     L
dog     M
fish    M
dtype: object

## Expanding data
Alignment and to-date

Rolling Computation window based on values instead of counts

Rolling Mean by Time Interval

## dfs - Splitting
Splitting a frame

Create a list of dataframes, split using a delineation based on logic included in rows.

In [194]:
df = pd.DataFrame(
    data={
        "Case": ["A", "A", "A", "B", "A", "A", "B", "A", "A"],
        "Data": np.random.randn(9),
    }
)
df

  Case      Data
0    A -0.350316
1    A -0.412806
2    A  0.328937
3    B  0.672269
4    A -1.848092
5    A -2.287886
6    B -0.326090
7    A  0.573630
8    A -1.024903

In [196]:
dfs = list(
    zip(
        *df.groupby(
            (1 * (df["Case"] == "B"))
            .cumsum()
            .rolling(window=3, min_periods=1)
            .median()
        )
    )
)[-1]

In [197]:
len(dfs)

3

## Pivot

## Apply

## Timeseries
Between times

Using indexer between time

Constructing a datetime range that excludes weekends and includes only certain times

Vectorized Lookup

Aggregation and plotting time series

Turn a matrix with hours in columns and days in rows into a continuous row sequence in the form of a time series. How to rearrange a Python pandas DataFrame?

Dealing with duplicates when reindexing a timeseries to a specified frequency

Calculate the first day of the month for each entry in a DatetimeIndex

## Resampling
The Resample docs.

Using Grouper instead of TimeGrouper for time grouping of values

Time grouping with some missing values

Valid frequency arguments to Grouper Timeseries

Grouping using a MultiIndex

Using TimeGrouper and another grouping to create subgroups, then apply a custom function GH3791

Resampling with custom periods

Resample intraday frame without adding new days

Resample minute data

Resample with groupby

## Merge
The Join docs.

Concatenate two dataframes with overlapping index (emulate R rbind)

## Plotting

## Data in/out

### CSV

## Computation
Numerical integration (sample-based) of a time series